/* GRSPW ROUTER APB-Register Driver.
 *
 * COPYRIGHT (c) 2010-2017.
 * Cobham Gaisler AB.
 *
 * The license and distribution terms for this file may be
 * found in the file LICENSE in this distribution or at
 * http://www.rtems.org/license/LICENSE.
 */

#include <rtems.h>
#include <rtems/libio.h>
#include <rtems/bspIo.h>
#include <stdio.h>
#include <bsp.h>

#include <drvmgr/drvmgr.h>
#include <grlib/ambapp_bus.h>
#include <grlib/grspw_router.h>

#include <grlib/grlib_impl.h>

//#define STATIC
#define STATIC static

#define UNUSED __attribute__((unused))

//#define DEBUG 1

#ifdef DEBUG
#define DBG(x...) printf(x)
#else
#define DBG(x...) 
#endif

#define THREAD_SAFE 1

#define REG_WRITE(addr, val) (*(volatile unsigned int *)(addr) = (unsigned int)(val))
#define REG_READ(addr) (*(volatile unsigned int *)(addr))


/*
 * ROUTER RTPMAP register fields
 */
#define RTPMAP_PE (0x7fffffff << RTPMAP_PE_BIT)
#define RTPMAP_PD (0x1 << RTPMAP_PD_BIT)

#define RTPMAP_PE_BIT 1
#define RTPMAP_PD_BIT 0

/*
 * ROUTER RTACTRL register fields
 * DEFINED IN HEADER
 */

/*
 * ROUTER PCTRL register fields
 * DEFINED IN HEADER
 */

/*
 * ROUTER PSTSCFG register fields
 * DEFINED IN HEADER
 */

/*
 * ROUTER PSTS register fields
 * DEFINED IN HEADER
 */

/*
 * ROUTER PTIMER register fields
 */
#define PTIMER_RL (0xffff << PTIMER_RL_BIT)

#define PTIMER_RL_BIT 0

/*
 * ROUTER PCTRL2 register fields
 * DEFINED IN HEADER
 */

/*
 * ROUTER RTRCFG register fields
 */

/*
 * ROUTER PRESCALER register fields
 */
#define PRESCALER_RL (0xffff << PRESCALER_RL_BIT)

#define PRESCALER_RL_BIT 0

/*
 * ROUTER IMASK register fields
 * DEFINED IN HEADER
 */

/*
 * ROUTER ICODEGEN register fields
 * DEFINED IN HEADER
 */

/*
 * ROUTER ISRTIMER register fields
 */
#define ISRTIMER_RL (0xffff << ISRTIMER_RL_BIT)

#define ISRTIMER_RL_BIT 0

/*
 * ROUTER AITIMER register fields
 */
#define AITIMER_RL (0xffff << AITIMER_RL_BIT)

#define AITIMER_RL_BIT 0

/*
 * ROUTER ISRCTIMER register fields
 */
#define ISRCTIMER_RL (0x1f << ISRCTIMER_RL_BIT)

#define ISRCTIMER_RL_BIT 0

/*
 * ROUTER CAP register fields
 */
#define CAP_AF (0x3 << CAP_AF_BIT)
#define CAP_PF (0x7 << CAP_PF_BIT)
#define CAP_RM (0x7 << CAP_RM_BIT)
#define CAP_AS (0x1 << CAP_AS_BIT)
#define CAP_AX (0x1 << CAP_AX_BIT)
#define CAP_DP (0x1 << CAP_DP_BIT)
#define CAP_ID (0x1 << CAP_ID_BIT)
#define CAP_SD (0x1 << CAP_SD_BIT)
#define CAP_PC (0x1f << CAP_PC_BIT)
#define CAP_CC (0x1f << CAP_CC_BIT)

#define CAP_AF_BIT 24
#define CAP_PF_BIT 29
#define CAP_RM_BIT 16
#define CAP_AS_BIT 14
#define CAP_AX_BIT 13
#define CAP_DP_BIT 12
#define CAP_ID_BIT 11
#define CAP_SD_BIT 10
#define CAP_PC_BIT 4
#define CAP_CC_BIT 0

/*
 * ROUTER PNPVEND register fields
 */
#define PNPVEND_VI (0xffff << PNPVEND_VI_BIT)
#define PNPVEND_PI (0xffff << PNPVEND_PI_BIT)

#define PNPVEND_VI_BIT 16
#define PNPVEND_PI_BIT 0

/*
 * ROUTER PNPUVEND register fields
 */
#define PNPUVEND_VI (0xffff << PNPUVEND_VI_BIT)
#define PNPUVEND_PI (0xffff << PNPUVEND_PI_BIT)

#define PNPUVEND_VI_BIT 16
#define PNPUVEND_PI_BIT 0

/*
 * ROUTER MAXPLEN register fields
 */
#define MAXPLEN_ML (0xffffff << MAXPLEN_ML_BIT)

#define MAXPLEN_ML_BIT 0

/*
 * ROUTER CHARO register fields
 */
#define CHARO_OR (0x1 << CHARO_OR_BIT)
#define CHARO_CC (0x7fffffff << CHARO_CC_BIT)

#define CHARO_OR_BIT 31
#define CHARO_CC_BIT 0

/*
 * ROUTER CHARI register fields
 */
#define CHARI_OR (0x1 << CHARI_OR_BIT)
#define CHARI_CC (0x7fffffff << CHARI_CC_BIT)

#define CHARI_OR_BIT 31
#define CHARI_CC_BIT 0

/*
 * ROUTER PKTO register fields
 */
#define PKTO_OR (0x1 << PKTO_OR_BIT)
#define PKTO_CC (0x7fffffff << PKTO_CC_BIT)

#define PKTO_OR_BIT 31
#define PKTO_CC_BIT 0

/*
 * ROUTER PKTI register fields
 */
#define PKTI_OR (0x1 << PKTI_OR_BIT)
#define PKTI_CC (0x7fffffff << PKTI_CC_BIT)

#define PKTI_OR_BIT 31
#define PKTI_CC_BIT 0

/*
 * ROUTER CRED register fields
 */
#define CRED_OC (0x3f << CRED_OC_BIT)
#define CRED_IC (0x3f << CRED_IC_BIT)

#define CRED_OC_BIT 6
#define CRED_IC_BIT 0

/*
 * ROUTER RTRCOMB register fields
 */
#define RTRCOMB_SR (0x1 << RTRCOMB_SR_BIT)
#define RTRCOMB_EN (0x1 << RTRCOMB_EN_BIT)
#define RTRCOMB_PR (0x1 << RTRCOMB_PR_BIT)
#define RTRCOMB_HD (0x1 << RTRCOMB_HD_BIT)
#define RTRCOMB_PE (0x7ffff << RTRCOMB_PE_BIT)
#define RTRCOMB_PD (0x1 << RTRCOMB_PD_BIT)

#define RTRCOMB_SR_BIT 31
#define RTRCOMB_EN_BIT 30
#define RTRCOMB_PR_BIT 29
#define RTRCOMB_HD_BIT 28
#define RTRCOMB_PE_BIT 1
#define RTRCOMB_PD_BIT 0

struct router_regs {
	unsigned int resv1;		/* 0x000 */
	unsigned int psetup[255];	/* 0x004 */
	unsigned int resv2;		/* 0x400 */
	unsigned int routes[255];	/* 0x404 */
	unsigned int pctrl[32];		/* 0x800 */
	unsigned int psts[32];		/* 0x880 */
	unsigned int treload[32];	/* 0x900 */
	unsigned int pctrl2[32];	/* 0x980 */
	unsigned int cfgsts;		/* 0xA00 */
	unsigned int timecode;		/* 0xA04 */
	unsigned int ver;		/* 0xA08 */
	unsigned int idiv;		/* 0xA0C */
	unsigned int cfgwe;		/* 0xA10 */
	unsigned int tprescaler;	/* 0xA14 */
	unsigned int imask;		/* 0xA18 */
	unsigned int ipmask;		/* 0xA1C */
	unsigned int pip;		/* 0xA20 */
	unsigned int icodegen;		/* 0xA24 */
	unsigned int isr0;		/* 0xA28 */
	unsigned int isr1;		/* 0xA2C */
	unsigned int isrtimer;		/* 0xA30 */
	unsigned int aitimer;		/* 0xA34 */
	unsigned int isrctimer;		/* 0xA38 */
	unsigned int resv4;		/* 0xA3C */
	unsigned int lrunsts;		/* 0xA40 */
	unsigned int cap;		/* 0xA44 */
	unsigned int resv5[111];	/* 0xA48 */
	unsigned int charo[31];		/* 0xC04 */ /* TODO check GR718 */
	unsigned int resv6;		/* 0xC80 */
	unsigned int chari[31];		/* 0xC84 */
	unsigned int resv7;		/* 0xD00 */
	unsigned int pkto[31];		/* 0xD04 */
	unsigned int resv8;		/* 0xD80 */
	unsigned int pkti[31];		/* 0xD84 */
	unsigned int maxplen[32];		/* 0xE00 */
	unsigned int resv9;		/* 0xE80 */
	unsigned int credcnt[31];	/* 0xE84 */
	unsigned int resv10[64];	/* 0xF00 */
	unsigned int resv11;		/* 0x1000 */
	unsigned int rtcomb[255];	/* 0x1004 */
};

struct router_priv {
	struct drvmgr_dev *dev;

	/* ROUTER control registers */
	struct router_regs *regs;

	#ifdef THREAD_SAFE
	/* ROUTER semaphore */
	rtems_id sem;
	#endif

	/* ROUTER driver register */
	char devname[9];
	int index;			/* Index in order it was probed */

	int minor;
	int open;
	struct router_hw_info hwinfo;
	int nports;
	int irq_init;

	SPIN_DECLARE(plock[32])

};

int router_count = 0;
static struct router_priv *priv_tab[ROUTER_MAX];

/* Driver prototypes */

STATIC int router_init(struct router_priv *priv);
STATIC void router_hwinfo(struct router_priv *priv,
			  struct router_hw_info *hwinfo);
STATIC int router_acontrol_set(struct router_priv *priv,
		struct router_route_acontrol *control);
STATIC int router_acontrol_get(struct router_priv *priv,
		struct router_route_acontrol *control);
STATIC int router_portmap_set(struct router_priv *priv,
		struct router_route_portmap *pmap);
